<a href="https://colab.research.google.com/github/sheptrundle/ds1002-dvf5rd/blob/main/homework/week-13.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Homework - Week 13

Complete the following blocks as specified in the directions. Run each cell to return the desired output. Save your notebook back to your GitHub repository and submit the GitHub URL to your notebook for review.

## 1. Change Runtime to R (1 pt)

Change the runtime of this notebook to R. You can verify that you are running R by displaying the current version you are running. Run the cell below and show the output.

In [ ]:
version

## 2. Create Vectors (2 pts)

Create two vectors in the cells below, according to the prompts given.

In [5]:
# create a vector with 7 integer values. Assign it to a variable named "my_integers"
my_integers <- c(1, 2, 3, 4, 5, 6, 7)

In [ ]:
var1 = 8
var2 = 4
var3 = 12
var4 = 25

# Using the variables given above, assign three new variables the following calculated values:
#
# 1. Your first variable should be assigned the calculated value of var2 divided by var1.
# 2. Your second variable should be assigned the calculated value of var2 cubed times var3.
# 3. Your third variable should be assigned the calculated value of var4 integer divided by var3.
#
# Next, create an array populated by your three variables. Assign the array to a new variable named "my_calculated_values"

first <- var2/var1
second <- (var2 ** 3) * var3
third <- var4 %/% var3

my_calculated_values <- c(first, second, third)
print(my_calculated_values)

## 3. Vector Indexes (3 pts)

In the cell below, create a vector that starts with the integer 4, that increments by counts of 3 all the way to 28.

Assign the vector to a variable name.

In [48]:
#
myvec <- seq(4,28,3)
myvec

[1]  4  7 10 13 16 19 22 25 28

Next, show how to display this vector with the 3 index removed.

In [49]:
#
myvec[-3]

[1]  4  7 13 16 19 22 25 28

Finally, show how to delete the 4th, 5th, and 7th indexes from the vector and update the vector so they are forever removed from the vector.

Hint: there is a fairly simple way to do this in one line, such that you don't have to run a separate command for each removal.

In [50]:
#
myvec <- myvec[c(TRUE, TRUE, TRUE, FALSE, FALSE, TRUE, FALSE, TRUE, TRUE)]

## 4. Create a Data Frame (3 pts)

In the cell below create a data frame with 10 observations (rows) and 5 variables (columns) each. This data frame will describe some of your favorite musical performers. You can use real or fictitious data to populate your data frame.

Variables:
  - `artist` - Artist or band name
  - `category` - Rock, Pop, Country, Hip-hop, Jazz, Classical, Soul, Other. (Try to distribute your selections here)
  - `size` - (number of members, 1-?)
  - `start` - Debut year of artist.
  - `grammy` - Grammmy winner? `TRUE` | `FALSE`

First create vectors for each variable populated with your own performer data. Then create a data frame from these vectors (be sure to assign column names too) and assign it to a named variable such as `df`.

In [58]:
artist <- c('Beatles', 'Kanye West', 'Pink Floyd', 'Colter Wall', 'Fake Jazz Band', 'Foo Fighters', 'Metallica', 'The Strokes', 'Grateful Dead', 'BJM')
category <- c('Rock', 'Rap', 'Rock', 'Country', 'Jazz', 'Rock', 'Metal', 'Alt Rock', 'Alt Rock', 'Modern Rock')
size <- c(4, 1, 5, 1, 7, 6, 4, 5, 6, 7)
#im making up the dates for start and values for grammy
start <- c(1965, 2005, 1978, 2010, 1922, 1989, 1976, 2003, 1969, 1995)
grammy <- c(TRUE, TRUE, TRUE, FALSE, FALSE, TRUE, TRUE, TRUE, TRUE, FALSE)

music <- data.frame(Artist = artist, Category = category, Size = size, Start = start, Grammy = grammy)
music

   Artist         Category    Size Start Grammy
1  Beatles        Rock        4    1965   TRUE
2  Kanye West     Rap         1    2005   TRUE
3  Pink Floyd     Rock        5    1978   TRUE
4  Colter Wall    Country     1    2010  FALSE
5  Fake Jazz Band Jazz        7    1922  FALSE
6  Foo Fighters   Rock        6    1989   TRUE
7  Metallica      Metal       4    1976   TRUE
8  The Strokes    Alt Rock    5    2003   TRUE
9  Grateful Dead  Alt Rock    6    1969   TRUE
10 BJM            Modern Rock 7    1995  FALSE

## 5. Filter/Query a Data Frame (2 pts)

Use the data frame you created above and show how to perform the following queries.

In [69]:
# Display the first 3 records and only the `artist`, `category` and `grammy` columns for each.
music[1:3, c('Artist','Category','Grammy')]

  Artist     Category Grammy
1 Beatles    Rock     TRUE
2 Kanye West Rap      TRUE
3 Pink Floyd Rock     TRUE

In [74]:
# Display the records for just one musical category, such as only Rock bands or only Hip-hop bands.
install.packages('tidyverse')
library(tidyverse)

music %>%
  filter(Category == 'Rock')

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

  Artist       Category Size Start Grammy
1 Beatles      Rock     4    1965  TRUE
2 Pink Floyd   Rock     5    1978  TRUE
3 Foo Fighters Rock     6    1989  TRUE

## Query a Data Frame using `tidyverse` (4 pts)

1. Show how to load the library.
2. Show how to glimpse basic features of the `starwars` data table.
3. Create a query using tidyverse that retrieves the following data:
    - Selects only these columns: `name`, `height`, `sex`, `species`.
    - Filters for all species that are NOT Human.
    - Arranges the resulting data in order by name.

Show your output in a data frame.

In [ ]:
install.packages('tidyverse')
library(tidyverse)

starwars[1:3 , 1:14]

In [95]:
starwars %>%
  select(name, height, sex, species) %>%
  filter(species == 'Human')
  arrange(name)
#ive tried to figure out why the arrange by name function is not working but i do not understand it, it should be arranged by names as that is the same
#code that i wrote in class with the titanic data and it worked fine for that

   name                height sex    species
1  Luke Skywalker      172    male   Human
2  Darth Vader         202    male   Human
3  Leia Organa         150    female Human
4  Owen Lars           178    male   Human
5  Beru Whitesun lars  165    female Human
6  Biggs Darklighter   183    male   Human
7  Obi-Wan Kenobi      182    male   Human
8  Anakin Skywalker    188    male   Human
9  Wilhuff Tarkin      180    male   Human
10 Han Solo            180    male   Human
11 Wedge Antilles      170    male   Human
12 Jek Tono Porkins    180    male   Human
13 Palpatine           170    male   Human
14 Boba Fett           183    male   Human
15 Lando Calrissian    177    male   Human
16 Lobot               175    male   Human
17 Mon Mothma          150    female Human
18 Arvel Crynyd         NA    male   Human
19 Qui-Gon Jinn        193    male   Human
20 Finis Valorum       170    male   Human
21 Shmi Skywalker      163    female Human
22 Mace Windu          188    male   Human
23 Gregar Typho        185    male   Human
24 Cordé               157    female Human
25 Cliegg Lars         183    male   Human
26 Dormé               165    female Human
27 Dooku               193    male   Human
28 Bail Prestor Organa 191    male   Human
29 Jango Fett          183    male   Human
30 Jocasta Nu          167    female Human
31 Raymus Antilles     188    male   Human
32 Finn                 NA    male   Human
33 Rey                  NA    female Human
34 Poe Dameron          NA    male   Human
35 Padmé Amidala       165    female Human

ERROR: ignored